//- Є змінна х, якій ви надаєте довільне числове значення.
 //   Якщо змінна x не дорівнює нулю, виведіть 'Вірно',
//   інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3

let x = 54;

if (0 != x) {
    console.log('Well');
} else {
    console.log('BAD');
}

//- Користувач вводить або має два числа.
// Потрібно знайти та вивести максимальне число з тих двох .
// Також потрібно врахувати коли введені рівні числа.

let minNum = 80;
let maxNum = 70;

if(minNum>maxNum){
    console.log(`max number is ${minNum}`);
}
else if (maxNum>minNum){
    console.log(`max number is ${maxNum}`);
}

else {
    console.log('number is the same');
}

//- є змінна х, яка може прийняти будь-яке значення (стрінг, число, undefined, null  і тд включно). Напишіть код який,
//    буде присвоювати змінній х значення "default"  якщо ви намагаєтесь присвоїти в неї falsy-значення (хибноподібні, тобто ті, які приводиться до false, а це 0 null undefined і тд).



